package by.bsuir;

/*
* Задание: Создать web-приложение (с использование технологии Servlet) позволяющее бронировать
* номера в гостинице. Определить роли пользователя и администратора для приложения.
* Общие требования к заданию:
*  - Интерфейс приложения должен быль локализован, языки: русский, английский.
*  - При успешной авторизации для пользователя должна создаваться сессия. При выходе из системы
* сессия пользователя должна уничтожаться.
*  - Информация о пользователях системы хранится в БД.
*  - Для доступа к БД использовать пул потоков.
*/
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}